//
// Created by XiMo on 2023/4/23.
//

#include "../include/menu.h"

void Menu::login() {
    cout << "----------------------------------------------------------------" << endl
         << "欢迎使用订单信息管理系统" << endl
         << "请选择登录身份" << endl
         << "1: 管理员" << endl
         << "2: 公司" << endl
         << "3: 公司注册" << endl
         << "0: 退出" << endl
         << "> ";
}

void Menu::main() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入对应功能前的编号来操作订单信息管理系统" << endl
         << "1: 添加订单" << endl
         << "2: 查询订单" << endl
         << "3: 修改订单" << endl
         << "4: 删除订单" << endl
         << "5: 订单排序" << endl
         << "6: 统计数据" << endl
         << "7: 显示所有订单" << endl
         << "0: 退出登录" << endl
         << "> ";
}

void Menu::adminQuery() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入对应功能前的编号来查询订单" << endl
         << "1: 根据订单编号进行精确查询" << endl
         << "2: 根据公司名称进行模糊查询" << endl
         << "3: 根据客户名称进行模糊查询" << endl
         << "4: 根据产品名称进行模糊查询" << endl
         << "5: 根据产品定价的范围进行查询" << endl
         << "6: 根据订购数额的范围进行查询" << endl
         << "7: 根据订购金额的范围进行查询" << endl
         << "8: 根据支付状态进行查询" << endl
         << "9: 根据订单状态进行查询" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::companyQuery() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入对应功能前的编号来查询订单" << endl
         << "1: 根据订单编号进行精确查询" << endl
         << "2: 根据客户名称进行模糊查询" << endl
         << "3: 根据产品名称进行模糊查询" << endl
         << "4: 根据产品定价的范围进行查询" << endl
         << "5: 根据订购数额的范围进行查询" << endl
         << "6: 根据订购金额的范围进行查询" << endl
         << "7: 根据支付状态进行查询" << endl
         << "8: 根据订单状态进行查询" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::adminChange() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入对应功能前的编号来修改订单信息" << endl
         << "1: 根据订单编号进行信息修改" << endl
         << "2: 根据公司名称进行信息修改" << endl
         << "3: 根据客户名称进行信息修改" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::companyChange() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入对应功能前的编号来修改订单信息" << endl
         << "1: 根据订单编号进行信息修改" << endl
         << "2: 根据客户名称进行信息修改" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::changeChoice() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入需要修改的订单信息前的编号" << endl
         << "1: 公司名称" << endl
         << "2: 客户名称" << endl
         << "3: 产品名称" << endl
         << "4: 产品定价" << endl
         << "5: 订购数额" << endl
         << "6: 支付状态" << endl
         << "7: 订单状态" << endl
         << "0: 完成修改" << endl
         << "> ";
}

void Menu::adminDelete() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入对应功能前的编号来删除订单" << endl
         << "1: 根据订单编号进行删除" << endl
         << "2: 根据公司名称进行删除" << endl
         << "3: 根据客户名称进行删除" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::companyDelete() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入对应功能前的编号来删除订单" << endl
         << "1: 根据订单编号进行删除" << endl
         << "2: 根据客户名称进行删除" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::adminSort() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入排序关键词前的编号" << endl
         << "1: 订单编号" << endl
         << "2: 公司名称" << endl
         << "3: 客户名称" << endl
         << "4: 产品名称" << endl
         << "5: 产品定价" << endl
         << "6: 订购数额" << endl
         << "7: 订单金额" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::companySort() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入排序关键词前的编号" << endl
         << "1: 订单编号" << endl
         << "2: 客户名称" << endl
         << "3: 产品名称" << endl
         << "4: 产品定价" << endl
         << "5: 订购数额" << endl
         << "6: 订单金额" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::adminStats() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入想要统计的数据前的编号" << endl
         << "1: 所有订单总额" << endl
         << "2: 某公司订单总额" << endl
         << "3: 某客户订单总额" << endl
         << "4: 某产品订单总额" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}

void Menu::companyStats() {
    cout << "----------------------------------------------------------------" << endl
         << "请输入想要统计的数据前的编号" << endl
         << "1: 所有订单总额" << endl
         << "2: 某客户订单总额" << endl
         << "3: 某产品订单总额" << endl
         << "0: 返回上级菜单" << endl
         << "> ";
}
